Revit 2027 API
WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings Method
 Get the WorksetDefaultVisibilitySettings of the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static WorksetDefaultVisibilitySettings GetWorksetDefaultVisibilitySettings(
	Document aDoc
)
Public Shared Function GetWorksetDefaultVisibilitySettings (
	aDoc As Document
) As WorksetDefaultVisibilitySettings
public:
static WorksetDefaultVisibilitySettings^ GetWorksetDefaultVisibilitySettings(
	Document^ aDoc
)
static member GetWorksetDefaultVisibilitySettings :
        aDoc : Document -> WorksetDefaultVisibilitySettings
Parameters
aDoc Document
 The document.
Return Value
WorksetDefaultVisibilitySettings
 The WorksetDefaultVisibilitySettings of the document.
Exceptions
Exception | Condition
ArgumentException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
ArgumentNullException |  A non-optional argument was null
Remarks
 WorksetDefaultVisibilitySettings is not available in family documents.
See Also
Reference
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace